---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementIntersectsElementFilter
source: html/98b42df6-b0a6-87f4-e186-da06ef64ba61.htm
---
# ElementIntersectsElementFilter Members

Constructs a filter to match elements which intersect the given element.